<template>
  <div>
    <h2>ルービックキューブの早解きについて知らない方々に知っておいて欲しいこと</h2>
    <p>
      このページの元ネタは、アメリカ在住の日本人キューバー、Mackyの下記の記事です。
      <a href="http://www.cubefreak.net/articles/fornoncubers.php">http://www.cubefreak.net/articles/fornoncubers.php</a>
    </p>

    <h3>キューバー（キュービスト）について</h3>
    <ul>
      <li>ルービックキューブの愛好家のことを、私達は「キューバー」または「キュービスト」と呼びます。</li>
      <li>キューバーは、ルービックキューブを解くことが好きです。それはただの趣味であったり、人によってはアイデンティティの一部でさえあります。国際的な組織が公式大会を運営し、世界中様々な言語でコミュニティーが展開されています。どうか、おかしな趣味だと一笑しないであげてください。</li>
      <li>私達は、キューブの回し心地を追求するために、とても努力しています。それらを取ったり、放り投げたりしないでください。</li>
      <li>学生ほどにもなれば、ルービックキューブの解き方を学ぶことは十分できます。ルールに従ってひとつひとつ手順を踏んでいき、いくつかの動かし方を学習すれば、ルービックキューブは解くことができます。</li>
      <li>ルービックキューブに数学的にアプローチすることはもちろん可能ですが、多くの解法は数学的な知識は全く必要なく、直感的に解くことができます。</li>
      <li>キューバーの中には数学や科学が好きな人はたしかにいますが、それはルービックキューブを解くうえでなんの役にも立ちません。</li>
    </ul>

    <h3>ルービックキューブの早解きについて</h3>
    <ul>
      <li>キューブを解くためにステッカーを剥がしたりは絶対にしないで下さい。キューブがだめになってしまいますし、そういった冗談は聞き飽きています。</li>
      <li>ルービックキューブを常に5秒で解ける人は世の中にはいません。もしあなたの友達や、道端、テレビ、YouTube等で5秒ほどで揃えている人がいるとしたら、それはズルをしているか、とてつもなくラッキーな場合だけです。</li>
      <li>ルービックキューブは最大でも20手で揃えられると言われていますが、通常早解きをする場合には、だいたい50手以上はかかります。30手以下で揃えたりするためには、1時間ほど試行錯誤必要があり、またそれでも30手以下で揃えられるとは限りません。</li>
      <li>キューブを適当に回していて偶然すべてが揃う確率は、数十億円の宝くじをあてるよりももっと低いです。3日間回し続けたとしても、揃うことは絶対にないでしょう。</li>
    </ul>

    <h3>ルービックキューブを解くのを見るときに</h3>
    <ul>
      <li>私達がキューブを見ずに回しているときには、次の可能性が考えられます。</li>
        <ul>
          <li>まずひとつは、ただ崩しているだけのときです。キューブを触っているうち、半分ほどはこの時間です。</li>
          <li>もうひとつは、あまりキューブを見ていなくても、揃えている場合があります。一般的な早解きの解法では、途中でたった７回見るだけで、揃えることができます。真剣に解くときにはずっとキューブを見ていますが、気軽に解く場合には、よそ見をしながらでも解くことができるのです。</li>
        </ul>
      <li>実はルービックキューブは、目隠しをしてでも解くことができます。そのためにはもちろん、事前に記憶の時間がいくらか必要ですが、決して手触りで解いたりしているわけではありません。</li>
      <li>キューブを解いているときに、一部のパーツが飛び出してしまうことがあります（これをPOPと呼びます）。これをはめて元に戻すことは、ズルではありません。また、戻すときに元通りの向きに戻さないと、解くことが不可能な状態になってしまいます。解いているうちにそれに気付き、もう一度パーツをはめ直すことがありますが、これも許してください。実際、パーツを外してズルをして解くよりも、普通に解く方がよっぽど早いのです。</li>
    </ul>

    <h3>ルービックキューブを崩すときに</h3>
    <ul>
      <li>私達の真似をして、速く回そうとしないで下さい。ゆっくりと崩してもらって大丈夫です。</li>
      <li>キューブを落とさないようにして下さい。キューブを落としてしまうと、壊れてしまったり、回し心地が変わってしまったりしてしまいます。私達はキューブを大事にしています。</li>
      <li>すべての色を離そうとする必要はありません。もし隣同士同じ色のところがあったとしても、それは十分に崩されています。</li>
      <li>崩しているのを私達が見ることは、キューブを解くときのヒントには全くなりません。私達からキューブを隠そうと後ろに手をまわして崩したりすると、キューブを落とさないかとても心配です。</li>
      <li>だいたい25～30回程度回せば、十分に崩れます。それ以上回しても、もっと難しくなるということはありません。</li>
      <li>公式ルールでは、解き始める前に15秒間までキューブを見る時間が与えられます。できればその時間を下さい。</li>
    </ul>
  </div>
</template>