<template>
  <div>
    <p>
      ルービッククロックをフリップ（反転）なしで解く方法の日本語解説です。
      元ネタは<a href="https://www.speedsolving.com/threads/no-flip-clock-method-with-less-calculations.86326/">No flip clock method with less calculations</a>です。
      この方法では、覚える数字は5つ、うち計算が必要な数字は1つだけです。
    </p>

    <h3>1. エッジ記憶</h3>
    <p>
      D,R,U,Lのエッジをセンターに合わせるにはいくらダイヤルを回せば良いかを覚えます。覚える順番が重要で、DRULの順に覚えます。
      例えば、Dエッジが5時、センターが3時を指している場合、覚える数字はマイナス2です。
      これを4回繰り返すことで、4つの覚えるべき数字かできます。
    </p>

    <h3>2. AUFトレース</h3>
    <p>
      AUFは計算で求めることもできますが（センターの初期値と記憶したエッジの逆値の和）、計算が苦手な場合はセンターの針を指でなぞることで算出可能です。
      まずセンターの針の場所を指さします。記憶したエッジの数字に従って、その数字の逆値（プラスマイナスが逆の値）分だけ指を動かしていきます。
      例えば、最初のセンター位置を3、記憶した数字を-2,0,5,-1とします。
      最初はセンターの3を指します。そこに2を足して、5になります。次は0なので、5から動きません。
      次は5を引くので、反時計回りに5動かし、0になります。
      最後に、時計回りに1回して、最終的に1になります。この数字がAUFとなり、最後に覚える数字です。
    </p>

    <h3>3. 反転</h3>
    <p>解き始めるための反転は、必ずx2（縦回し）にします。</p>

    <h3>4. 解き方</h3>
    <p>
      Uピン2つがup、Dピン2つがdownで開始します。下のダイヤルで、記憶した最初の数字を回します。
      上のダイヤルで、センターとDエッジを合わせます。この2つのダイヤルは、同時に回すことができます。
    </p>
    <p>
      次に、Rピン2つをup、Lピン2つをdownにします。左のダイヤルで、2つ目の数字を回します。右のダイヤルで、センターとLエッジを合わせます。
    </p>
    <p>
      Dピンをup、Uピンをdownにします。上のダイヤルで3つ目の数字を回し、下のダイヤルでセンターとUエッジを合わせます。
    </p>
    <p>
      Lピンをup、Rピンをdownにします。右のダイヤルで4つ目の数字を回し、左のダイヤルでセンターとRエッジを合わせます。
    </p>
    <p>
    最後に、すべてのピンをdownにして、ダイヤルはどこでも良いので、AUFの数字を回します。
    AUFは各エッジが終わる前に実行することも可能なので、スクランブルのピン位置によっては最初にするほうがいいかもしれません。
    ただし、2回やらないように注意してください。
    </p>
    <p>
    これで、背面のエッジとセンターがすべて12時を向き、前面のセンターとエッジ向きがすべて揃っている状態になります。前面は12時になっている必要はありません。
    コーナーは、好きなように解いてください。
    </p>

    <h3>ヒント</h3>
    <ul>
      <li>エッジとセンターのはじめから針があっているところがあれば、そちら側を記憶する面にしたほうが、記憶やトレースをする数が減るので楽かもしれません。</li>
      <li>記憶のした数字のなかに逆値の数字（例えば-3と3）がある場合、AUFをトレースする際にはそれらは相殺されるので無視することができます。</li>
    </ul>
  </div>
</template>