<template>
  <div>
    <h2>ルービックキューブ目隠しの解法</h2>
    <p>
      ルービックキューブを目隠しで解く方法は、普通に解くのに最も一般的な「CFOP法」（LBL法）とは、根本的に全く異なる解法を用います。
    </p>
    <p>
      そのため、極端に言ってしまえば、目隠しで解くためには普通に解けるという事は必須事項ではありません。しかし、回し慣れていることは必要ですので、必然的にほとんどの人が普通に解くことから始めると思います（中には、目隠しで解くのは日本トップレベルでも普通に解くには中級レベル、という人もいます）。
    </p>

    <h2>目隠し解法の基本</h2>
    <p>
      いわゆるスピード解法と言われるCFOP法では、ルービックキューブを揃える課程を、Cross、F2L、OLL、PLLと細かいステップに分け、それぞれの課程で手順を回して揃えます。
    </p>
    <p>
      この方法では、F2Lが終わった時点でキューブを見てOLLを判断、手順を回し、OLLが終わった時点でキューブを見てPLLを判断、手順を回す、といった具合に、各ステップが終わるごとにキューブを見て、どのパターンに当てはまるかを判断し、その手順を回します。
    </p>
    <p>
      F2Lが完全に終わる前にどのOLLになるかを判断するいわゆる「先読み」といったテクニックはありますが、例えばOLLを始める前にPLLが何かを完全に判断できる人はおそらくいません。
    </p>
    <p>
      ましてや、最初からCROSS、F2L、OLL、PLLをすべて読み切って解くなんていう芸当は、まず不可能です。そこで、ルービックキューブを目隠しをして揃えるためには、
      <ul>
        <li>各パーツ（エッジ・コーナーそれぞれ）が、どこにいけば良いか（揃えることができるか）を覚える</li>
        <li>目的のパーツ（通常3つセット）以外を動かさないようにパーツを移動する</li>
      </ul>
      という方法で揃えていきます。解法はすべとエッジパートとコーナーパートに分けられ、その組み合わせが目隠しの解法となります。 
    </p>

    <h2>各種解法</h2>
    <h3>EOEP + COCP</h3>
    <p>
      エッジ・コーナーそれぞれを、まず向きを合わせ(Edge(Corner) Orientation)、その後場所を合わせる(Edge(Corner) Permutation)というものです。ルービックキューブを目隠しで揃えるということが世界に広まったときに、最初に提案されたのがこの方法です。
    </p>
    <p>
      この解法は、考え方自体が分かりやすい、覚える手順が少なくて済むといった利点はありますが、記憶時に向き、場所を別々に覚えるため、
      <ul>
        <li>最低でも同じパーツを2巡して記憶する必要がある。</li>
        <li>ステップが多いため、手数が多くなる。</li>
      </ul>
      といったデメリットがあり、今の時代に目隠しを始めるにおいて、この解法を選ぶ理由は全くありません。
    </p>
    <p>
      しかし、場所移動のない単純なEO・COの手順は次に述べる解法でも有用になる場合も多いため、その解法自体を知っていることは大きな利点になります。
    </p>

    <h3>M2 + R2</h3>
    <p>
      Stefan Pochmannが2007に提唱した解法です(<a href="https://www.stefan-pochmann.info/spocc/blindsolving/M2R2/">M2/R2 blindcubing methods</a>)。
    </p>
    <p>
      EOEP + COCPと違い、現在主流となっている向きと位置を同時に揃える方法の基礎となった解法です。エッジをM2法、コーナーをR2法と言われる方法で揃えます。必要な手順も少なく、目隠しで解くのに問題となるパリティ処理も簡単で、非常に優れた解法です。
    </p>
    <p>
      しかし、特にR2法については例外パターンが多く、手順を覚えるのが少し大変です。
    </p>

    <h3>M2 + COCP</h3>
    <p>
      エッジをM2法で、コーナーをCOCP法で解く、ハイブリッド方式です。コーナーをCOCPで解くデメリットはありますが、比較的分かりやすい解法のため、一時スタンダードな解法とされていました。
      </p>
    <p>
      しかし、やはり目隠し競技のスピード化に伴い、COCPは今では推奨されません。
    </p>

    <h3>M2 + Old Pochmann （おすすめ！）</h3>
    <p>
      エッジをM2法で、コーナーをOld Pochmann法で解く方法です。BLDを始めるにおいて、もっともスタンダードと言って良い方法です。
    </p>
    <p>
      Old Pochmann法は、前述のR2法よりも前にStefan Pochmannが提案したものですが、覚える手順がほとんどなく、またM2法と組み合わせることでパリティ（後述）の処理も簡単にすることができます。
    </p>

    <h3>3cycle</h3>
    <p>
      目隠し競技で国内・世界トップレベル（具体的には記憶時間込みで50秒未満程度）を目指すのであれば、必須である解法です。
    </p>
    <p>
      しかし、手順が非常に多い（エッジ・コーナー合わせて500以上（！））ことから、習得が難しく、いきなりここから始めるのはおすすめできません。
      しかし、コミュテーターという概念を理解すれば手順すべてを丸暗記する必要もないことから、習得をしている人からすれば、言われるほど難しいものではないという人もいます。

    <h2>パリティとは</h2>
    <p>
      目隠しで解くうえで、「パリティ」という言葉が必ずでてきます。
    </p>
    <p>
      「目隠し解法の基本」の中で、エッジ・コーナーをそれぞれパーツを動かして揃えていくと説明しました。ルービックキューブがある程度解ける人なら理解していることと思いますが、ルービックキューブでは「3つのパーツだけの交換」は可能（PLLでのU-Perm、A-Perm等）ですが、「2つのパーツだけの交換」は不可能です。
    </p>
    <p>
      しかし、エッジの3点交換をしていくと、最終的に2つのエッジの交換だけが残ることがあります。その状態のことを、「パリティがある」といいます。
    </p>
    <p>
      では不可能であるはずの2点交換をどのように解消するかというと、エッジに2点交換が残る場合には、コーナーにも必ず2点交換が残ります。そして、エッジ2点＋コーナー2点の交換であれば、これは可能です（PLLでのJ-Perm、Y-Perm等）。
    </p>

    <p>
      パリティがあるかないかの確率は完全に五分五分ですので、このパリティ処理をどのように行うかは、目隠しで解くうえでとても重要な要素になります。
    </p>
  </div>
</template>