<template>
  <div>
    <h2>FAQ（よくある質問）</h2>
    <h3>DRとはなんですか？</h3>
    <p>
      DRとはDomino Deductionの略で、2軸のEOとコーナー向きが揃った状態のことです。
      2軸のEOとは、通常のEOに加えてE層（中間層）のエッジがすべてE層にある状態を指します。
      この状態になると、あとは[U, D, L2, R2, B2, F2]の回転だけでキューブを揃えることができます。
    </p>

    <h3>なぜDRを学ぶ必要があるのですか？</h3>
    <p>
      はじめはDRはセットアップが難しい感じるでしょうし、目標の手数で「完成」させるのはもっと難しいと思うでしょう。
      でもマスターすれば、安定してとても美しい回答を得ることができるようになります。
    </p>

    <h3>DRを学ぶには何から始めればいいですか？</h3>
    <p>
      EOさえ習得すれば、DRを始めるために必要な知識は揃っています。
      とはいえ、EOをただの上級テクニックとして知っているだけなのであれば、
      DRを学ぶ前にもっと学ぶべきことはあるはずです。
    </p>
       
    <h3>「DR後キューブが良い状態に見える」とはどういう意味ですか？</h3>
    <p>
      とても優秀なFMC競技者が、このようなことを言っているのを聞いたことがあるかもしれません。
      そのほとんどは、感覚によるものです。
      DR状態にあるキューブはないものより簡単に解けるように見えますし、EOのあるキューブはないものよりも簡単に見えます。
    </p>

    <h3>DRってホントにいいんですか？</h3>
    <p>
      DRは、80%以上の確率で10手以内のものを見つけることができます。
      ときには難しいこともありますが、ある程度練習すれば、12手以内で安定してDRを作ることができるようになります。
      DRが終わると、そこからの「神の数字」は18手(*)となり、その解法は「人力」の方法でほとんど見つけることがでまきす。
      つまり、DRは30手以内の解答を得るための確実で安定した方法なのです！
    </p>
    <p>*http://kociemba.org/cube.htm</p>
  </div>
</template>