<template>
  <div>
    <p>
      訳注：このガイドは、2019年に執筆されたものです。
    </p>
    <h2>はじめに</h2>
    <p>
      この1年で、ドミノリダクションはFMCにおいて最高の解法になりました。
      TGBBO 2019ではHarry Savageの17手、FMC 2019ではSebastiano Trontoによる16手の記録がドミノリダクションにより出され、
      その驚くべき解法を見た私達（著者2名）は、この方法を習得する決意をしました。その旅に、皆様をお連れしたいと思います。
    </p>
    <p>
      現在、ドミノリダクションについて書かれた文書はなく、習得するためには、誰かの解答例を読むか、その人に説明してもらうしかありません。
      そのため、解法の用語が世界で統一されていなかったり、正確な名称すらないステップもあり、ある種の混乱が生じています。
      このガイドの目的は、ドミノリダクションの概略を説明し、用語を統一することです。
    </p>
    <p>
      このガイドを読み始める前に、Sebastianoの<a href="https://fmcsolves.cubing.net/fmc_tutorial_ENG.pdf">FMCチュートリアル</a>
      を読むことを強く推奨します（訳注：kawamさんによる<a href="https://kawam1123.github.io/translation/FMC/FMC-Tutorial/v3/">日本語訳バージョン</a>も参照）。
      このチュートリアルは、イタリアではFMCの「聖書」とも呼ばれており、このガイドの構成の元となっています。
      これから使う用語や略語の多くはFMCの世界では一般的なものがほとんどですが、これから初めてFMCに取り組む方は、まずは基本的なことから始めて、慣れてください。
      また、このガイドを執筆するにあたって、Sebastianoはいくつかの解答例の提供に協力してくれました。
      このガイドの目的は、彼が書いてくれていることに、ドミノリダクションについて私達が知っているすべてのことを付け加えることです。
      これは、彼の著作に続く「第二章」のようなものだと思ってください。少なくとも、そうなることを願っています。
      お分かりかと思いますが、私たちはイタリア語を母国語とします。そのため、もし間違いを見つけた場合は、ガイドの最後に記載したメールアドレスに直接ご連絡ください。
    </p>
    <p>
      以後、ドミノリダクション(Domino Reduction)の事をDRと記載します。また、すでにE層（中間層）にあるE層のエッジを「グッド」エッジ、E層にないエッジを「バッド」エッジと呼びます。
    </p>
    <p>
      すべてのセットアップケースは「DR - x Eエッジ、yコーナー」となり、これらを「xエッジ、yコーナー」と呼ぶこととします。
      解答例では、Sebastianoの提案に準じて、コーナーを「c」、エッジを「e」、センターを「x」と表記します。
      また、各ステージの呼び方は「F2L-1」のように、最も一般的な名称を使用します。
      例えば、「3c2e2e4x」は「完成まで3つのコーナー、エッジの入れ替え2つ、4つのセンター」という意味です。
    </p>
    <p>
      DRの基本を理解するのは思ったより簡単で、FMCの知識もそれほど必要ありません。
      しかし、その能力を最大限に発揮するには、FMCの高度なテクニックがいくつか必要です。
    </p>
    <p>
      DRを完成させるには、エッジ反転の方法について知っておく必要があります。
      DRの完成度をより上げるためには、NISSとコーナー・エッジのインサートの知識が必要になることがほとんどです。
      本当に良い方法でDRを使いこなすには、とても幸運なケースを引き当てるか、DRの仕上げに逆NISS、センターインサーション、スライスインサーション
      といったその他多くの高度なFMCの技術を組み合わせる必要があります。
    </p>
    <div class="text-center">
      <nuxt-link to="/fmc/domino-faq">FAQ（よくある質問）</nuxt-link> | <nuxt-link to="/fmc/domino-reduction">目次</nuxt-link> | <nuxt-link to="/fmc/domino-chapter1">グッドEO</nuxt-link>
    </div>
  </div>
</template>