<template>
  <div>
    <h2>ルービックキューブ最少手数競技の紹介</h2>
    <h3>ルービックキューブ最少手数とは</h3>
    <p>
      ルービックキューブ最少手数（Fewest Move Challenge：通称FMC）とは、世界キューブ協会(WCA:World Cube Association)が開催する公式競技のひとつです。
    </p>
    <p>
      ほとんどのルービックキューブの競技は揃える「速さ」を競うものですが、最少手数競技は、制限時間1時間以内に、ルービックキューブをいかに「少ない手数」で揃えることができるかを競う競技です。
    </p>
    <h3>最少手数競技の流れ</h3>
    <p>  
      競技者が用意するものは、ルービックキューブを3つまでと、必要であればキューブに目印として貼るためのステッカーです（飲み物や時計の持ち込みは適宜認められています）。
    </p>
    <p>
      まず、キューブを崩すための「崩し手順」が書かれた問題用紙兼解答用紙と、メモ用紙、ボールペンが配られます（実際に配られる用紙のサンプルはこちら。英語が書かれていますが、ルールを理解していれば特に読む必要はありません）。
    </p>
    <p>
      競技が始まると、崩し手順を用いてルービックキューブを崩し、それをどれだけ短い手順で揃えられるか解法を考えます。制限時間内であれば、何度も揃えては崩しを繰り返し、試行錯誤することができます。
    </p>
    <p>
      崩す方法が分かっているのなら、それと逆に回せば一番短くなるではないか？という疑問がありますが、もちろんこれは認められません。最初の数手が偶然崩し手順の逆になっていることは構いませんが、基本的には「崩し手順とは異なる方法で」「論理的に説明できる方法で」完成させないといけません。
    </p>
    <p>
      そして、自分が考えた解法を回転記号を用いて書き、提出します。それを大会運営者が採点し、一番手数の短い解法を考えた人が優勝となります。
    </p>
    <h3>最低限必要な素養</h3>
    <p>  
      普通にルービックキューブを揃えるだけの競技ではないため、どうしても最低限必要な技術があります。
    </p>

    <h3>ルービックキューブの回転記号を知っていること</h3>
    <p>
      これは絶対条件です。崩し手順を見て自分でルービックキューブを崩し、そこから揃える方法を回転記号を用いて書きます。ルービックキューブを解く練習をする上でも手順を理解するのに必要な知識です。
    </p>
    <p>
      また、持ち替え記号（(r), (u), (f)、またはx, y, z）を使うことも可能です（持ち替えは手数に含まれません）。
    </p>
    <p>
      ただし、中段層回転（M, S, E）は禁止されています。
    </p>
    <p>
      【参考】Cube Voyage : <a href="https://cubevoyage.net/how-to-solve/intermediate/notation/">回転記号とは？</a>
    </p>

    <h3>2. 80手以内で揃えられること</h3>
    <p>
      最少手数競技では、80手を超える解答は失格というルールがあります。ですので、どんな解法でも構いませんが、80手を超えてしまってはいけません。
    </p>
    <p>
      試しに、自分が解いている方法で、何手で揃えることができるか数えてみて下さい。最も一般的な解法であるCFOP法（LBL法）で、F2L、OLL、PLLをすべて使いこなせるのであれば、だいたい60手前後あれば揃えられるはずです。
    </p>
    <p>
      もし覚えていないOLLやPLLがあっても、最少手数競技の場合は制限時間内であれば何度でもやり直すことができるので、知っている手順ができるまで試してみれば良いのです。
    </p>
    <p>
      80手というのは、そこまで高いハードルではないはずです。
    </p>
    <p>
      最少手数競技に出るために必要な素養はこの2つだけです。
    </p>
    <p>
      より少ない手数で揃えるために、色々な特殊な解き方やテクニックはありますが、とりあえず競技としてでるだけであれば、普通にルービックキューブが解ければいいのです。
      私自身、2010年日本大会から最少手数競技に出場し（記録は55手）、2015年2月の早稲田頭脳戦で初めて30手を切る29手の記録をだしましたが、本格的に最少手数のためのテクニックを学びだしたのは2013年の10月頃から、記録としては35手を切ったあたりからです。
    </p>
    <p>
      最少手数競技は、上級者しか参加できないハードルの高いものではなく、普通に揃えても速く揃えられない人でも、試行錯誤や運（重要）でトップレベルの記録が残せる可能性のある種目です。
    </p>
  </div>
</template>